Repository: remald/srbot
Catalog: i18n/locales/*/LC_MESSAGES/srbot.po
Languages: ru

# help
source: Supported commands: /self_trained_esrgan - deep neural network for image super resolution, trained by me /original_esrgan - esrgan pretrained by authors NOTE: This model is NOT for low-quality image quality improvement. This is for resolution increase only.It works in a really bad way with compressed images, because it is sensitive to any information losses caused by image compression like JPEG. It's recommended to unset the "Compress Images" checkbox when sending the photo. Please send it as a document, not as a photo.
ru: Поддерживаемые комманды: /self_trained_esrgan - с помощью ESRGAN, обученной мной /original_esrgan - с помощью ESRGAN, обученной авторами архитектуры ВНИМАНИЕ: Эти модели не предназначены для улучшения качества сильно пережатых изображений, имеющих артефакты сжатия, зашумленность или иные дефекты, приводящие к существенной потере информации. Модель только для увеличения разрешения изображений в хорошем качестве. Она работает очень плохо для изображений, использующих значительный уровень сжатия и артефакты, потому что она очень чувствительна к потерям информации, которые происходит при сжатии JPEG и др. Так же рекомендуется снять галочку "Сжать изображения" при отправке картинки в телеграмм. Рекомендуется отправлять изображение как документ, а не как фото.

# start
source: Hi! I'm a newest AI system! I use deep learning to do some magic! Give me a photo and the magic will happen! NOTE: max supported pix resolution is 256*256! Though you still can sand me a larger photo, it will be resized to 256 * 256 size using bicubic filter. For more information, type /help
ru: Привет! Я - бот, использующий новейшие технологии обработки изображений! Я использую deep learning для невероятно реалистичного увеличения разрешения! Просто отправьте мне изображение и вы увидите магию современного deep learning! Вы можете выбрать одну из двух моделей: обученную автором бота и обученную авторами архитектуры ESRGAN. Внимание: максимально поддерживаемое разрешение - 256*256! Если вы отправите мне фото большого разрешения, оно будет автоматически уменьшено до размера 256 * 256 с использованием бикубического фильтра. Используйте /help, чтобы получить более подробную информацию о боте и командах.

# downscaled
source: Downscaled image after bicubic resize (256 * 256 is max supported size)
ru: Я уменьшил ваше изображение с помощью бикубической фильтрации (256 * 256 - максимально поддерживаемый размер. Размер определяется по произведению ширины на высоту)

# done
source: I did some magic ðŸ˜º
ru: Готово. Разве не волшебно? 😺

# orig_selected
source: Original model is selected!
ru: Выбрана оригинальная модель, обученная авторами ESRGAN!

# self_selected
source: Self-trained model is selected!
ru: Выбрана самостоятельно обученная модель!

# face_selected
source: Face enhance model is selected!
ru: Выбрана модель с функцией улучшения лиц!

# wait_task
source: Your picture is being processed now! This may take a while depending on the pic size.
ru: <b><u>Ваша картинка обрабатывается.</u></b> Это может занять некоторое время, в зависимости от разрешения.

# misunderstood
source: You told me something weired
ru: Я вас не понимаю. Вы говорите мне странное.

# look_at_this
source: Well, look at this...
ru: Взгляните на это...

# ram_price
source: RAM price is growing day by day. I am not getting enough funding from my Master to have enough memory to handle such large pictures. I could ask you to donate, but my Master forbids me. He says it's indecent. Now I will resize your image to fit 256 * 256 size.
ru: Цены на оперативную память растут изо дня в день. Финансирования, которое получаю от моего хозяина, мне хватило только на 8 Гб оперативной памяти. Этого не хватает на обработку картинок, больших чем 256*256 пикселей. Я мог бы попросить у вас донейт, но мой хозяин запрещает мне это. Он говорит что это неприлично. Сейчас я преобразую ваше изображение к размеру 256 * 256 пикселей.

# send_as_doc
source: WARNING! You sent the image as a photo. It's not recommended, because telegram compresses it. Please send as a document, to achieve the best performance.
ru: <b><u>ВНИМАНИЕ!</u></b> Вы отправили изображение как фотографию. Телеграм сжимает все отправляемые фото.Чтобы достичь максимального результата, отправляйте изображение как документ, без сжатия.

# uncompressed
source: Uncompressed document
ru: Версия без сжатия телеграм
